package com.pha.trainees.Twilightwood;

//真的在翻我的源码吗……那给你点惊喜好了


public class TW {
    public boolean getLove(){
        return true;
    }


    protected static class txt{
        /*
        小作文
123456
但那种痛苦换成谁也会为之动摇。眼看着她认不出我的模样……
​那一刻，我的模样便从世界上彻底消失。没有人认得我，没有人记住我。走在熙熙攘攘的大街上，穿过人潮涌动的商场，除了无垠的风，没有人会注意我。
​我因她的注视而活着，我的整个世界因她有我的记忆而运转着。如果……她也认不出了我……
在数不清的夜晚，我哽咽着，趁眼泪未流下时睡去。
只有见了她，让她认出我一遍，我才会活着。
离她没有认出我那一刻，已经过去很久了，秋草也生了又枯，很久了。
我总来看她，她却也不说什么，但偶尔无垠的风声过耳，也能让我有些许误会，让我错以为她还能认出我，还在跟我说话。
在偶然里，在幽红的火光里，我曾误以为瞥见了她，看见她碰着老相识而激动的脸颊，她却又转瞬而熄。
我也曾想，还是算了，来不来，有多大关系呢，我会介意，但她不会……不，她还能认出我吗？她肯定会什么都不说。可我还是来了。
又何必说再见呢？倘若事隔经年。可若纵然万物生情，大抵的思念也不减当年之每时每刻，误以为她从没有离开我的身边。
​真正的感情是压抑不了的。
如果给我一个机会，坐在她的身旁……
我害怕得发抖。
她笑着告诉我，匆匆几年，​我见过太多因爱而痛苦，因爱而死。嘴即使堵住，眼睛会泄露。眼即使闭了，动作会泄露。动即使掩饰，心跳亦会泄漏。爱是忍不住的，它难以抵挡，甚是不可抵挡。
​那你呢？
​我愈发惊恐。这不是她……她的语气，她的笑容，甚至是她的一切，在我眼中极速扭转而下坠着。她似注意到了，转过身抖了抖袖子，丢下一个小罐子。想我的时候就吃吧，她走之前对我说。//
​回想起，才恍然发觉，她从没出现。我看的皆是妄想，不过南柯一梦。而我停转的世界，只留下给我做白日梦的时间。
​拾起罐子的那一刻，整个世界不断颠倒着，我头晕目眩，如溺水般在眼前一片虚无里挣扎着……良久，我睁开眼，一罐安眠药立在我眼前。我扶着脑袋，起身拉开窗帘。阳光要把我皮肤给烧烂了。
​墙上的时钟很早就不转了，指针停留在日落时分。我这样想着，扭头看向窗外。夕阳十分美好。
​我踩着自己的影子走在路上，夕阳托起了长长的尾巴，但我并没有为此感伤。
溪边两岸缠绵的微风，引阳光共舞，它们一起旖旎描摹着蝴蝶的轮廓，我难得欢喜片刻，我不假思索地把微风与阳光握在手里，这样不论何时，我都能看到她的影子。
我倒在大街上。路人都以为是醉酒的鬼。我的猜想是对的，握着她的影子，就能见到她。
​她突然变得若隐若现。我慌张地问她怎么了，她不语，只是笑着。我反复问她，上前试图抓起她的手……可，什么都没有。我的手径直穿了过去。而就在那一瞬间，整个世界轰然崩塌。她一个闪身消失在夕阳的最后一缕阳光里。
​但我并未随着建筑碎屑落下去，我仍停留原地。须臾，整个世界只剩下一片黑暗。没有声响，没有光亮，一片死寂。我感受到前所未有的恐慌，虚无一直在试图泯灭我。
​你倒是露面啊，来打一架啊，这样整有什么骨气。我冲着远方缓缓出现的一束刺眼的白光吼道。光亮不断扩大。我感到头一阵疼痛，随后重重摔在地上……我被人打倒了。//
​再睁开眼，我回到了我的房间。床边站着一个穿着古怪，带着威慑力的人。祂见我醒来，扔给我一把刀和之前掉在地上的药罐，说。
以刀斩断轮回，去寻她。再用药，只会成为她的养分。不过，你仍然可以抉择。
​祂的声音似乎从很遥远的地方而来……待我慢慢理解了祂的话时，祂早已不在。这段话是什么意思？我想不明白。
​那把刀呈月牙状，刀柄上有龙的纹样，整把刀身闪着奇怪的红光。我把它锁在箱子里，推开窗，用尽浑身力气将钥匙扔出去。奇怪的是，钥匙一脱手就消失了。这样也无妨。
​随后，我将剩下半罐药一次吞下。因为如果用刀划开喉咙，我的声音便发不出来了。
时间足够久。景秋微凉。我与她相依为命，秋风已来，秋风已来，我与她在那里慢慢老去。秋风停了，秋风停了，我与她也渐渐消失了。 秋的思念，秋的思念，那是她的眼泪，那是她的独白，那是她最不愿离开的地方， 后来，那里只剩下关于她的回忆…再后来……那些不能说的思念终将成为秘密，成为永恒！念而不扰，想而不见………
不知哪一场春雨，或许是第几百场吧。麦子熟了十几次，回忆聚散十几次。她终于回来了。
她撑着一把黑伞蹲在我身边。
雨渐渐停了，太阳重新照耀。她收起了伞。
只存在于童话里的彩虹，在这一刻出现在她身后。
她终于认出了我。她哽咽着抚摸我的脸。又是一年春天，我终于见到了她。
她的手传来一阵冰凉。她慌了，赶忙伸手试探我的鼻息……她不知道，那早已停了。
眼泪，如刚才的雨一样落下。这让人心旷神怡的好天气，怎会有人哭泣？
她这样安静地看着我。她终于醒悟几十年前那人的模样。那就是我。她懊悔没有认出我……
她起身走了走。就在这一瞬，一道利刃刺穿了她的胸膛。她眼神一惊，瞳孔收缩，随即又像早就预料到什么，神情放松下来。
她忍着痛拔出剑，捂着伤口，一瘸一拐走在我身旁的空地上，躺了下来，望着湛蓝的天空。阳光还在猛烈地照，彩虹还在尽情舒展。
爱，能超越死亡的力量
我的身躯在此一瞬间消失，因为我的执念太深没有回去，现在应该清算了。
我的模样却在这一瞬浮现，因为她已认出了我，我再也不会被任何人忽视。
我心满意足地笑着，笑容如彩虹一样弯着。
整个世界下，只有我开口说话的声音。
那是我生时不断开口言说的，只为在她认出我时告诉她的：
“过去这么久，我始终咽不下最后一口气。就为了对你说这句话。
你终于肯认出我了。
杨二，我喜……”
……//

“真可惜啊，连最后一句话都没法说完整。真叫我看了一出好戏呢。”
你是谁？
这是一个女生的声音，却意外十分像她。
少女无视了我的疑问。
“太久没有睁开眼，你已经忘了她的模样吧。”
我点点头……又摇摇头。
她青春时的模样我永远记得……不会忘的。
我感觉到少女的声音就在我眉头。我感觉到我坐哪里，靠着什么。
“看看我吧，嘻嘻……”
我奋力用手扒开眼皮。
那少女正是她！
……
为什么？我的疑惑代替了震惊和恐惧。
接着，我很快注意到，我所在的地方，正是她那天没有认出我地方。
在学校的楼梯上。她与我坐在一起。
“你知道为什么她……或者说我？那时认不出你吗？”
我摇摇头。
“我不会直接告诉你。但，认不出你，永远是假的。”
她认得我的模样？不是忘了还是什么的？
“当然了……还有，她就是我哦。”
你？但你不像……
说来也怪，长的真的一模一样……
“嘻嘻……”
“谁知道你所看到的一切，哪些是梦，哪些是真的？”
我还没死？
……
我刚才不经意闭上了眼。少女……或者说她，并没有回答我。我等待良久，睁开眼。她早已不再。
我仍然坐在学校的楼梯上。
我活动了下筋骨，走进教学楼。
熟悉的班级……
我一眼就看到了她，那个仍旧是青春年华，正和同学说笑的她。我的世界一下子有了色彩。我回到我的座位上坐下。
难道一切都是一场梦？
……
可是却又那么真实。
我打了个哈欠，又睁开眼。同学们全不见了。班级里蒙上一层粉色，夕阳透过窗户照进来，窗户外面只有一片白。
教室里只剩下阳光，门上原本能看到走廊的窗户只有一片黑暗。
阳光是粉色的，它柔和地照着整个教室。
教室里安静地可怕，没有脚步声，甚至电子设备使用时的轻微滋滋声也消失不见。
我看到她站在一扇窗户前，向外望着什么。
我走过去，拍了拍她的肩，看着她的眼睛。

潮红迅速布上少女的脸颊，她用略带愠怒的眼这看我，却又败下阵来，扭过头去小声嘟囔。
纵然是梦，我也心满意足了。因为此时的她，才是真正的她。
我突然想到了什么似的，忙拍拍她，示意她转过头来。她扭过头看着我。避免像上次一样说太多，这次直接说最后一句就好。我急匆匆对她说：
“杨二，我喜……”
……

“又失败了呢……”
她的声音在我耳边。这或许还是那个少女……
不过，耳边却响起了一个我意想不到的声音。
“不得不说，你很有趣……”
是祂的声音。那天给了我一把刀，和我掉落在地上的安眠药的那人。
我有太多疑问，但又说不出口。我也睁不开眼。
“不过，打破轮回的仍然是那把刀。”
我想起她被刺穿胸膛时脸上的惊慌。
我乞求他们不要再提及这一幕……
“我记得你把刀锁在盒中，把钥匙丢去了。但刺穿她的刀，仍是那一把。而行凶之人，正是现在的她。”
我心头一惊。
青春的她，刺死了未来的她，导致现在的我走出噩梦，这个噩梦，便是未来的我为了她而不断堕落的梦？你给未来的我那把刀，是想让我自己救自己，我却放弃了这个机会，但误打误撞让她救下了？
“大部分没错……”
少女此时抢过话说：
“但是由于不是梦的主角——你，刺她的哟。而这个梦吧，又有一些特别哟。所以，未来的她，真的会不见了哟。
嘻嘻，照这么说，不就是我在咒未来的自己被人捅死啦。”
……

我从床上坐了起来。星星还未隐藏好自己，朝霞便已出门了。我的房间也压着一层粉色的光，看起来蛮温馨。
哪里才是真实，究竟是哪里……
颠沛流离，什么在等着我？我现在坐着的床，是现实吗？如果这里还是梦，那么出路究竟是什么？这一切为什么都这么真实？
我知道了，我知道……破局之法！
只要大声说出那句话，就成功了！
杨二，我喜欢你……
……
……
什么都没发生……
不，我周围开始震动了。
我的错觉？不，真的在震动。有用了！我就知道，破局之法，我找着了……
地震……
我来不及想，躲在了床底。吊灯直直摔在床上，周围的一切迅速崩塌。地震平稳了些……趁现在，跑！
我抓起了一块掉落下来的木板，举在头顶，防止小石子砸在头上。我迅速跑下楼梯，来到空地上。劫后余生的人们喘着粗气。
我摸摸口袋，里面居然还有我的手机。我掏出手机照了照自己。原来我早已成年，但还没找到工作，暂时在家里躺着。
等等……我预感到什么不对。梦中的她……
说时迟那时快，我骑上不知道哪来的自行车往她家骑去。尽管身边的建筑都在崩塌，却与我毫不相干。我就这么骑行在到处崩塌的大路上，从容又危机……
我丢下车子，随着去她小区附近支援的人一同过去。大的震波已经过去，接下来的已经不太大了。于是政府迅速展开搜救行动。望着昔日高楼如树林般的城市，此刻就像在平地上撒了一大把石子。
……
志愿者首先发现了她。我拼了命的跑过去。
我不信，这一切只是巧合而已……因为她的胸膛，正好插着一把刀。鲜血汩汩流出，看的人是一个心凉。我仔细一看，刀柄上正正好有龙纹，而刀身是弯曲的……这不可能，这不可能……
救护车刚到，下来许多人。我身旁的志愿者招呼着手，示意担架队来这里。
我突然发疯似的，靠近她，把那一柄弯刀抽出来。旁边的人本想制止我说伤口严重刀不能拔，但已经晚了……
她被抬上担架。
这不可能……
……

我们被安放在临时避难所里。因为我逃出来早，只是擦破了皮，医护人员便先去处理其他伤员了，只给了我两个面包和一瓶水。我不想吃东西，只是把水瓶盖拧开，抿了一小口，却反胃到差点吐出来。我把面包都给了身边一个年轻的男孩，他忙问我怎么不吃，给了他。我说我不想吃。他只好反复感谢了我，打开包装狼吞虎咽起来。
我问他多大了，他说他今年就十五岁了，正在上初二。问他今天几号，他说是三月四号。
原来是春天。
我不再说话，盯着我怀里的刀发呆。她大概率是治不好的，因为这把刀刺穿的是要害，况且还不是第一时间找到的。我不愿意想，也不愿意说出那个词……
死亡。

下午，我去慰问她的亲人。
我在这当志愿者，刚好这是我同学，我来问问。
……
“她已经走了……”
唯有沉默。
……
见此，我也不好在说什么。拍了拍那人的肩膀，扭头走掉。
我就这么漫无目的地行走在大街上。我所见到的，梦到的一切，也都同这场地震，一起崩塌掉了。
不知不觉，我走到了学校。我的母校，现在也塌得不成样子。
学校里空无一人，因为是周天。保安室也没有人，全到对面家属院去支援了。我又回到那个石楼梯上。没想到这里没有受损，似乎是专门预料到我要来，比较完整。但也确实楼梯附近都是空地。
走了很久，我坐下了。不知不觉，太阳要落下去了。

……
和你共看夕阳，虽然身不在一起，但心会在一起吧。
不对……
自始至终这一切都不对……
我决定赌一下，
赌我仍在梦中。
我想起梦中的她对我说的话，“匆匆几年，​我见过太多因爱而痛苦，因爱而死。”
因爱而痛苦，那么，因爱而死……！
我举起那柄一直带着的刀，猛一下刺进我的胸膛。
鲜血没有像我预料的那样喷涌而出，疼痛没有像我预料的那样席卷全身。
时间静止了。刚才还在飞的鸟儿静止在天空中。
这不太对，但是我赌对了。
“真没想到啊，小黄眼……”
又是那个和她长得一模一样的少女，此刻她正鼓着掌不知从哪走过来。
小黄眼？奇怪的名字。我的眼睛确实有些黄。
她没有脚步声似的，突然走到我面前，一把从我胸膛抽出那把刀。我只感觉背上被人轻轻锤了一下，低头一看，衣服都是完整的。
“意思是，你的行动完全出乎祂的意料。至于祂？我也不知道，反正你们没见过面。嘻嘻？”
下一秒，我眼前一黑……

“哟，醒了？”
我妈对我说。我抱着还亮着的手机，上面是我和她的私聊页面。我还流着口水，揉了揉眼。
我下意识看了眼时间，问，我咋了？
“你坐着和你同学聊天聊睡着了，睡可香了。你看你们聊的都是什么东西。好了。赶紧起来，你同学来你家了。”
我站起身，往卧室外走去。
我看到她坐在沙发上……
她冲我嘻嘻笑，拉着我的手跑出门外。
“唉，衣服都没穿……”

“我草，你来找我干啥？”
“别装了，早都见过了……”她露出无奈的神情
“啥意思？”我有点后怕，她说的不会是梦里吧。
“还装，嘻嘻。就是你想的那样。”她笑盈盈的。
“我想的是你来表白。”
“去你的，还表白。我说的是梦啦。”
……
“怎么啦，后劲很大吗？还是太震惊了？嘻嘻，都说不话来了。”她笑了起来。
“你不是她，你到底是谁？”
她露出了更加夸张的笑容。“好啦，逗你玩的啦。说不定我真喜欢你呢……”
我挣脱她的手，往家里跑去。
“唉，去哪啊小黄眼……”
轮回，一切都是轮回。宿命，一切都是宿命。注定，一切都是注定！只有那一句话！不带任何犹豫！

杨二，我喜欢你！

我的眼前一阵杂乱，最终又回到了学校的石楼梯上。
看镜头来……三……二……一！
青春无悔，基泥苔煤！
我站在台阶上最高级的第一个位置。我找不到她。此时，她还没有来我们班。她是转校生。
她没有认出那时的我……但也无所谓，只需要有心就足够了。她与好朋友活跃着，不断给我发一些消息。
这样就好了……

你所见的真实，真的是真实吗？

第二天，“我”被送进了医院。“我”的病特别古怪，一觉起来直接瘫倒，查出了癌症晚期。可是“我”的身体之前一点异常都没有……
不出意料，不过几天，“我”就病死了……
但她还活着，这就足够了。因为我已经见到她两次死亡了……那么“我”的第二次，也该来了。
“你还看得入迷么？”一个清晰的男音。
他继续说，“我没想到你还喜欢看这个……真可以。不过听说，这个好像和你的前世有些关系啊。”
“我就是奔着这个来的……你傻是不是。”
杨二……我琢磨着。

我特别喜欢其中的一句话，你所见的真实，一定是真实吗？
就像现在一样。
真正清醒的人，又有几个呢？所有人都在入梦，你又何尝不是，而那些清醒的人又何尝不是罪人？
哪里有真实？没有。
如果你愿意回看，一切或许都是南柯一梦。它有时是蠢货为了爱情而做着傻梦，服下安眠药见她。有时是死亡以后留着一口气，为了给十几年后的她一番话语。有时又是在教室里，望着她的眼，看着她脸红。有时还是为了她的安危，为她而奔波。但这一切，都是祂的手笔，都是祂设置的轮回。
出乎祂意料的，便是“我”最后一刻仍旧愿意赌一把，彻底打破轮回。轮回的载体是梦，梦套梦，永远不会有人醒来。
而“我”，或者换个身份？那个给“我”提供弯刀的祂，穿着古怪的祂，就是“我”。不过“我”的癖好真古怪，亲手刺死梦中她，再自刎，才能脱离梦中梦。
不过，一切都是有解释的。因为所见之物不一定真实，况且还在梦中。梦里的她是幻想的，是假的她，不可信，也不能依赖。
如此，追求希望与真实，才是你该做的……

梦，该醒了。
那句话，你从未说出口。那么，你已身处现实，不妨对她说吧。
杨二，
我喜欢你！
         */
    }
}



